blog.org
#+STARTUP: show2levels
#+HUGO_BASE_DIR: .
#+hugo_section: blog

* Now
:PROPERTIES:
:EXPORT_HUGO_SECTION: /
:EXPORT_FILE_NAME: now
:END:

** What I'm doing at the moment

/(This is [[http://nownownow.com/about][a Now page]]. Where's yours?)/

I'm living in Mannheim, Germany,

- working as a backend developer at [[https://ioki.com/][ioki]],
- serving as a member of ioki's first works council,
- practicing my trombone under the guidance of [[https://der-trompetenlehrer.de/][Ralf-Werner Kopp]],
- rehearsing and playing with [[https://theuplifters.de/][The Uplifters & Block Ice Horn Section]],
- practicing for my first rehearsals with my new band [[https://www.instagram.com/theoffbeatservice/][The Offbeat Service]],
- training at [[https://www.muskeltiere-sport.de/][muskeltiere Mannheim]], or kettlebelling in my garden.

When my activities or priorities change, I'll update this page. Last
update was August 10, 2024.

