content/now.md
+++
title = "Now"
author = ["Florian Posdziech"]
draft = false
+++

## What I'm doing at the moment {#what-i-m-doing-at-the-moment}

_(This is [a Now page](http://nownownow.com/about). Where's yours?)_

I'm living in Mannheim, Germany,

-   working as a backend developer at [ioki](https://ioki.com/),
-   serving as a member of ioki's first works council,
-   practicing my trombone under the guidance of [Ralf-Werner Kopp](https://der-trompetenlehrer.de/),
-   rehearsing and playing with [The Uplifters &amp; Block Ice Horn Section](https://theuplifters.de/),
-   practicing for my first rehearsals with my new band [The Offbeat Service](https://www.instagram.com/theoffbeatservice/),
-   training at [muskeltiere Mannheim](https://www.muskeltiere-sport.de/), or kettlebelling in my garden.

When my activities or priorities change, I'll update this page. Last
update was August 10, 2024.
